{
  "chemicals": [
    {"id":"HCl","name":"Hydrochloric Acid","type":"acid","color":"rgba(255,90,90,0.6)"},
    {"id":"H2SO4","name":"Sulfuric Acid","type":"acid","color":"rgba(255,180,60,0.6)"},
    {"id":"HNO3","name":"Nitric Acid","type":"acid","color":"rgba(255,210,80,0.6)"},
    {"id":"CH3COOH","name":"Acetic Acid","type":"acid","color":"rgba(255,150,110,0.6)"},
    {"id":"NaOH","name":"Sodium Hydroxide","type":"base","color":"rgba(90,240,180,0.6)"},
    {"id":"KOH","name":"Potassium Hydroxide","type":"base","color":"rgba(80,230,210,0.6)"},
    {"id":"NH3","name":"Ammonia","type":"base","color":"rgba(180,240,200,0.6)"},
    {"id":"Na2CO3","name":"Sodium Carbonate","type":"base","color":"rgba(200,255,255,0.6)"},
    {"id":"NaHCO3","name":"Sodium Bicarbonate","type":"base","color":"rgba(210,255,240,0.6)"},
    {"id":"NaCl","name":"Sodium Chloride","type":"salt","color":"rgba(255,255,255,0.7)"},
    {"id":"AgNO3","name":"Silver Nitrate","type":"salt","color":"rgba(230,230,230,0.8)"},
    {"id":"BaCl2","name":"Barium Chloride","type":"salt","color":"rgba(220,240,255,0.7)"},
    {"id":"CuSO4","name":"Copper(II) Sulfate","type":"salt","color":"rgba(0,150,255,0.6)"},
    {"id":"FeCl3","name":"Ferric Chloride","type":"salt","color":"rgba(200,150,80,0.6)"},
    {"id":"PbNO3","name":"Lead(II) Nitrate","type":"salt","color":"rgba(240,240,200,0.8)"},
    {"id":"KMnO4","name":"Potassium Permanganate","type":"oxidizer","color":"rgba(120,0,160,0.6)"},
    {"id":"K2Cr2O7","name":"Potassium Dichromate","type":"oxidizer","color":"rgba(255,130,30,0.6)"},
    {"id":"FeSO4","name":"Iron(II) Sulfate","type":"salt","color":"rgba(120,170,170,0.6)"},
    {"id":"ZnSO4","name":"Zinc Sulfate","type":"salt","color":"rgba(190,190,200,0.6)"},
    {"id":"Ca(OH)2","name":"Calcium Hydroxide","type":"base","color":"rgba(170,250,190,0.6)"}
  ],
 "reactions": {
  "HCl+NaOH": {
    "reaction": "Neutralization",
    "safety": "Exothermic; avoid splashes.",
    "color": "rgba(255,255,190,0.6)",
    "animation": "pulse-bubbles",
    "description": "Hydrochloric acid reacts with sodium hydroxide in a classic neutralization. Hydrogen ions from HCl combine with hydroxide ions from NaOH to form water, while sodium and chloride ions remain in solution. The reaction releases heat and demonstrates energy change. Neutralization is important in titrations and pH regulation. Observe gentle bubbling and slight warmth. This reaction exemplifies acid-base chemistry and ion interactions. It is widely used in lab demonstrations and school experiments."
  },
  "H2SO4+NaOH": {
    "reaction": "Neutralization",
    "safety": "Add acid to base slowly.",
    "color": "rgba(255,235,160,0.6)",
    "animation": "pulse-strong",
    "description": "Sulfuric acid reacts with sodium hydroxide forming sodium sulfate and water. Each H+ ion reacts with OH- ions, producing heat. This diprotic acid reaction is more exothermic than HCl+NaOH. Neutralization reactions are essential for pH control in labs. Observe vigorous bubbling and heat release. Proper handling and slow addition are required for safety. Demonstrates acid-base interactions and energy change. Common in industrial and educational chemistry experiments."
  },
  "HNO3+Na2CO3": {
    "reaction": "Gas evolution",
    "safety": "Vent gas; avoid inhalation.",
    "color": "rgba(240,250,255,0.7)",
    "animation": "fizz-fast",
    "description": "Nitric acid reacts with sodium carbonate producing carbon dioxide, water, and sodium nitrate. Carbonic acid forms transiently and decomposes to CO2, causing rapid bubbling. This shows acid-carbonate interaction. Reaction is used in gas generation and lab demonstrations. Effervescence demonstrates chemical change and gas evolution. Ensure proper ventilation to avoid inhaling CO2. Highlights reaction stoichiometry, energy release, and observable chemical transformations."
  },
  "CH3COOH+NaHCO3": {
    "reaction": "Effervescence",
    "safety": "Do not seal container.",
    "color": "rgba(240,255,240,0.7)",
    "animation": "fizz-soft",
    "description": "Acetic acid reacts with sodium bicarbonate forming carbon dioxide, water, and sodium acetate. CO2 escapes as bubbles, creating visible effervescence. Carbonic acid forms briefly and decomposes. This demonstrates acid-carbonate reactions commonly used in baking and chemistry demonstrations. Observe rapid bubbling and gas release. The reaction shows energy release and chemical transformation. Containers must remain open to prevent pressure buildup. Highlights reaction kinetics and observable gas evolution."
  },
  "AgNO3+NaCl": {
    "reaction": "Precipitation",
    "safety": "Protect from light.",
    "color": "rgba(240,240,240,0.9)",
    "animation": "cloudy-fall",
    "description": "Silver nitrate reacts with sodium chloride to form insoluble silver chloride as a curdy white precipitate. Sodium nitrate remains in solution. Precipitation reactions are used for qualitative analysis. AgCl is light-sensitive and may darken over time. Observers notice cloudiness forming quickly. Reaction highlights ion interaction and compound formation. Demonstrates solubility rules and chemical change. Widely used in lab experiments and analytical chemistry."
  },
  "BaCl2+H2SO4": {
    "reaction": "Precipitation",
    "safety": "Dispose per guidelines.",
    "color": "rgba(255,255,255,0.9)",
    "animation": "cloudy-dense",
    "description": "Barium chloride reacts with sulfuric acid forming insoluble barium sulfate and hydrochloric acid. Dense white BaSO4 precipitates immediately. Precipitation demonstrates solubility rules and chemical change. Observers see solid forming in solution, indicating ionic reaction. Commonly used to test for sulfate ions. Highlights ionic exchange and visual observation of chemical processes. Reaction is safe with proper disposal. Demonstrates precipitation chemistry effectively."
  },
  "CuSO4+FeSO4": {
    "reaction": "Ion exchange",
    "safety": "Avoid ingestion.",
    "color": "rgba(120,170,170,0.6)",
    "animation": "swirl-color",
    "description": "Copper sulfate reacts with iron(II) sulfate, exchanging ions in solution. Color shifts due to redistribution of metal ions. Demonstrates ion exchange and solution chemistry principles. Observation includes gradual color change as ions interact. Highlights metal ion behavior and chemical transformations. Reaction shows energy changes in ion distribution. Used in teaching ionic interactions and solution dynamics. Provides a visual demonstration of chemical change in aqueous solutions."
  },
  "CuSO4+FeCl3": {
    "reaction": "Complex formation",
    "safety": "Avoid skin contact.",
    "color": "rgba(80,120,200,0.6)",
    "animation": "swirl-deep",
    "description": "Copper sulfate reacts with ferric chloride forming complex ions in solution. Color deepens as metal-ligand interactions occur. Demonstrates coordination chemistry and electron sharing. Observation includes solution darkening and visible reaction. Highlights complex formation, ionic interaction, and solution chemistry principles. Reaction is exothermic. Used in lab demonstrations to visualize chemical bonding. Proper handling avoids corrosive hazards. Offers a clear visual effect of molecular interactions."
  },
  "KMnO4+FeSO4": {
    "reaction": "Redox",
    "safety": "Stains; handle carefully.",
    "color": "rgba(150,80,160,0.5)",
    "animation": "fade-out",
    "description": "Potassium permanganate reacts with iron(II) sulfate in a redox reaction. KMnO4 decolorizes as Fe2+ ions oxidize to Fe3+. Reaction demonstrates electron transfer between species. Observers notice fading purple color, showing redox chemistry. Common in volumetric analysis and lab demonstrations. Highlights reaction kinetics and energy changes. Reaction is visually striking and educational. Proper handling prevents staining and safety risks. Demonstrates oxidation-reduction principles clearly."
  },
  "K2Cr2O7+FeSO4": {
    "reaction": "Redox",
    "safety": "Toxic; PPE required.",
    "color": "rgba(120,220,140,0.5)",
    "animation": "fade-green",
    "description": "Potassium dichromate reacts with iron(II) sulfate as a redox reaction. Cr2O7^2− is reduced while Fe2+ oxidizes to Fe3+. Green tinge appears in solution, showing chemical change. Reaction demonstrates electron transfer and redox principles. Used in titrations and analytical chemistry. Observers notice gradual color change. Highlights stoichiometry, oxidation states, and energy shifts. Safety precautions are essential due to toxicity. Provides a vivid demonstration of redox reactions."
  },
  "NH3+HCl": {
    "reaction": "Neutralization",
    "safety": "Irritant vapors.",
    "color": "rgba(255,255,255,0.8)",
    "animation": "smoke-line",
    "description": "Ammonia gas reacts with hydrogen chloride gas forming ammonium chloride. White smoke forms along the air path due to sublimation. Reaction demonstrates acid-base neutralization in gaseous form. Observers see dense white smoke lines. Highlights gas-phase reactions and sublimation of solid products. Demonstrates energy change and rapid product formation. Widely used in teaching chemistry visually. Requires ventilation and PPE for safety."
  },
  "Ca(OH)2+CO2": {
    "reaction": "Carbonation",
    "safety": "Ventilate.",
    "color": "rgba(255,255,255,0.8)",
    "animation": "milk-cloud",
    "description": "Calcium hydroxide reacts with carbon dioxide forming insoluble calcium carbonate. Limewater turns milky, indicating CO2 presence. Reaction is used for gas detection and carbonation demonstrations. Highlights precipitation reactions and acid-base chemistry. Observers see cloud formation in solution. Demonstrates chemical change, solubility rules, and gas absorption. Reaction is gentle and educational. Provides clear visual feedback of chemical transformations."
    }
  }
}